app/views/api/pokemon/show.json.jbuilder

SELECT "items".* FROM "items" WHERE "items"."pokemon_id" = $1  [["pokemon_id", 1]]
---
json.items do
  @pokemon.items.each do |item|